<?php

use Illuminate\Database\Seeder;

class PatternsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('patterns')->truncate();

        $array = array(
            '女'=>2,'男'=>1,

            '10歳以下'=>1,'10代前半'=>2,'10代後半'=>3,'20代前半'=>4,'20代後半'=>5,'30代前半'=>6,'30代後半'=>7,'40代前半'=>8,'40代後半'=>9,'50代'=>10,'60代'=>11,'70歳以上'=>12,

            'スポーツ'=>1,'読書'=>2,'PC'=>3,'旅行'=>4,'音楽'=>5,'映画鑑賞'=>6,'ドライブ'=>7,'ゲーム'=>8,'料理'=>9,
            'お酒'=>10,'ショッピング'=>11,'手芸&裁縫'=>12,'グルメ'=>13,'ガーデニング'=>14,'アイドル'=>15,'その他'=>16,

            '誕生日'=>1,'結婚記念日'=>2,'Xmas'=>3,'出産祝い'=>4,'結婚祝い'=>5,'手土産'=>6,'引っ越し'=>7,'お中元&お歳暮'=>8,
            '父の日'=>9,'母の日'=>10,'敬老の日'=>11,'卒業&就職祝い'=>12,'入学祝い'=>13,

            '本'=>1,'DVD･音楽'=>2,'TVゲーム'=>3,'家電･カメラ･AV機器'=>4,'パソコン･オフィス用品'=>5,'ホーム&キッチン･DIY'=>6,
            '食品･飲料･お酒'=>7,'ドラッグ&ビューティー'=>8,'ベビー･おもちゃ'=>9, '服'=>10,'シューズ'=>11,'バッグ'=>12,
            '腕時計'=>13,'スポーツ&アウトドア'=>14,'車&バイク'=>15,

            //二桁目がman,一桁目がageのid
            '男_10歳以下'=>11,'男_10代前半'=>12,'男_10代後半'=>13,'男_20代前半'=>14,'男_20代後半'=>15,'男_30代前半'=>16,
            '男_30代後半'=>17,'男_40代前半'=>18,'男_40代後半'=>19,'男_50代'=>110,'男_60代'=>111,'男_70歳以上'=>112,

            '女_10歳以下'=>21,'女_10代前半'=>22,'女_10代後半'=>23,'女_20代前半'=>24,'女_20代後半'=>25,'女_30代前半'=>26,
            '女_30代後半'=>27,'女_40代前半'=>28,'女_40代後半'=>29,'女_50代'=>210,'女_60代'=>211,'女_70歳以上'=>212,

            '男_birth'=>11,'男_xmas'=>13,
            '女_birth'=>21,'女_xmas'=>23,

            '10歳以下_birth'=>11,'10代前半_birth'=>21,'10代後半_birth'=>31,'20代前半_birth'=>41,'20代後半_birth'=>51,'30代前半_birth'=>61,
            '30代後半_birth'=>71,'40代前半_birth'=>81,'40代後半_birth'=>91,'50代_birth'=>101,'60代_birth'=>111,'70歳以上_birth'=>121,

            '10歳以下_xmas'=>13,'10代前半_xmas'=>23,'10代後半_xmas'=>33,'20代前半_xmas'=>43,'20代後半_xmas'=>53,'30代前半_xmas'=>63,
            '30代後半_xmas'=>73,'40代前半_xmas'=>83,'40代後半_xmas'=>93,'50代_xmas'=>103,'60代_xmas'=>113,'70歳以上_xmas'=>123,

            '男_本'=>11,'男_DVD･音楽'=>12,'男_TVゲーム'=>13,'男_家電･カメラ･AV機器'=>14,'男_パソコン･オフィス用品'=>15,'男_ホーム&キッチン･DIY'=>16,
            '男_食品･飲料･お酒'=>17, '男_ドラッグ&ビューティー'=>18,'男_ベビー･おもちゃ'=>19,'男_服'=>110,'男_シューズ'=>111,'男_バッグ'=>112,
            '男_腕時計'=>113,'男_スポーツ&アウトドア'=>114,'男_車&バイク'=>115,

            '女_本'=>21,'女_DVD･音楽'=>22,'女_TVゲーム'=>23,'女_家電･カメラ･AV機器'=>24,'女_パソコン･オフィス用品'=>25,'女_ホーム&キッチン･DIY'=>26,
            '女_食品･飲料･お酒'=>27,'女_ドラッグ&ビューティー'=>28,'女_ベビー･おもちゃ'=>29,'女_服'=>210,'女_シューズ'=>211,'女_バッグ'=>212,
            '女_腕時計'=>213,'女_スポーツ&アウトドア'=>214,'女_車&バイク'=>215
        );



        $c = 1;

        foreach($array as $key => $value){
            DB::table('patterns')->insert([
                'id' => $c,
                'name' => $key,
                't_id' => $value,
            ]);
            $c += 1;
        }

    }
}
